In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel(r'C:\Users\Pc World Computers\Desktop\Pandas - Complete\Temperature.xlsx')

In [3]:
df

         Date        City  Temperature  Humidity
0  26/07/2022      London         22.0      30.0
1  27/07/2022      London         20.0      22.0
2         NaN         NaN         18.0       NaN
3  26/07/2023      Attock          NaN       8.0
4  27/07/2023         NaN         44.0      10.0
5         NaN      Attock         35.0      12.0
6  26/07/2024  Rawalpindi          NaN       NaN
7  27/07/2024         NaN         41.0      16.0
8  28/07/2024  Rawalpindi         32.0      12.0

In [4]:
df.dtypes

Date            object
City            object
Temperature    float64
Humidity       float64
dtype: object

In [5]:
df['Date'] = df['Date'].astype('datetime64[s]')

In [6]:
df.dtypes

Date           datetime64[ns]
City                   object
Temperature           float64
Humidity              float64
dtype: object

In [7]:
df['Temperature'].fillna(df['Temperature'].mean(),inplace=True)

In [8]:
df['Humidity'].fillna(df['Humidity'].mean(),inplace=True)

In [9]:
df.isnull().sum()

Date           2
City           3
Temperature    0
Humidity       0
dtype: int64

In [10]:
df["City"].interpolate(inplace=True)

In [11]:
df["City"].ffill(limit=2,inplace=True)

In [12]:
df.isnull().sum()

Date           2
City           0
Temperature    0
Humidity       0
dtype: int64

In [13]:
df.dtypes

Date           datetime64[ns]
City                   object
Temperature           float64
Humidity              float64
dtype: object

In [14]:
df[['Temperature','Humidity']] = df[['Temperature','Humidity']].astype('int64')

In [15]:
df.dtypes

Date           datetime64[ns]
City                   object
Temperature             int64
Humidity                int64
dtype: object

In [16]:
df

        Date        City  Temperature  Humidity
0 2022-07-26      London           22        30
1 2022-07-27      London           20        22
2        NaT      London           18        15
3 2023-07-26      Attock           30         8
4 2023-07-27      Attock           44        10
5        NaT      Attock           35        12
6 2024-07-26  Rawalpindi           30        15
7 2024-07-27  Rawalpindi           41        16
8 2024-07-28  Rawalpindi           32        12

In [17]:
df.pivot_table(index='City',columns="Temperature")

            Humidity
Temperature       18    20    22    30    32    35    41    44
City
Attock           NaN   NaN   NaN   8.0   NaN  12.0   NaN  10.0
London          15.0  22.0  30.0   NaN   NaN   NaN   NaN   NaN
Rawalpindi       NaN   NaN   NaN  15.0  12.0   NaN  16.0   NaN

In [18]:
df.isnull().sum()

Date           2
City           0
Temperature    0
Humidity       0
dtype: int64

In [25]:
df['Date'].ffill(limit=2,inplace=True)

In [26]:
df.isnull().sum()

Date           0
City           0
Temperature    0
Humidity       0
dtype: int64

In [27]:
df.to_excel('new_temperature.xlsx')